In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                 'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'],
                 'data2': range(3)})

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [6]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [7]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                 'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'],
                 'data2': range(3)})

In [9]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [10]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [11]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [12]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [13]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [15]:
pd.merge(df1, df2, how='outer')

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [16]:
pd.merge(df1, df2, how='left')

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [17]:
pd.merge(df1, df2, how='right')

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

In [18]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                 'data1': range(6)})
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                 'data2': range(5)})

In [19]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [20]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [24]:
pd.merge(df1, df2, on='key', how='right')

    data1 key  data2
0     0.0   b      1
1     1.0   b      1
2     5.0   b      1
3     0.0   b      3
4     1.0   b      3
5     5.0   b      3
6     2.0   a      0
7     4.0   a      0
8     2.0   a      2
9     4.0   a      2
10    NaN   d      4

In [22]:
pd.merge(df1, df2, on='key', how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [23]:
pd.merge(df1, df2, on='key', how='outer')

    data1 key  data2
0     0.0   b    1.0
1     0.0   b    3.0
2     1.0   b    1.0
3     1.0   b    3.0
4     5.0   b    1.0
5     5.0   b    3.0
6     2.0   a    0.0
7     2.0   a    2.0
8     4.0   a    0.0
9     4.0   a    2.0
10    3.0   c    NaN
11    NaN   d    4.0

In [25]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                  'key2': ['one', 'two', 'one'],
                  'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'rval': [4, 5, 6, 7]})

In [26]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [28]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [32]:
pd.merge(left, right, on=['key1', 'key2'], how='inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [33]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [37]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [38]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [43]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [44]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [45]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                   'value': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [46]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [47]:
right1

   group_val
a        3.5
b        7.0

In [48]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [53]:
pd.merge(left1, right1, left_on='key', right_index=True , how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [54]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                  'key2': [2000, 2001, 2002, 2001, 2002],
                  'data': np.arange(5)})
righth = DataFrame(np.arange(12).reshape((6, 2)),
                  index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'], [2001, 2000, 2000, 2000, 2001, 2002]],
                  columns=['event1', 'event2'])

In [55]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [56]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [57]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [58]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

   data    key1  key2  event1  event2
0   0.0    Ohio  2000     4.0     5.0
0   0.0    Ohio  2000     6.0     7.0
1   1.0    Ohio  2001     8.0     9.0
2   2.0    Ohio  2002    10.0    11.0
3   3.0  Nevada  2001     0.0     1.0
4   4.0  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000     2.0     3.0

In [62]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                  index=['a', 'c', 'e'],
                  columns=['Ohio', 'Nevada'])
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12], [13., 14]],
                  index=list('bcde'), columns=['Missouri', 'Alabama'])

In [63]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [64]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [66]:
pd.merge(left2, right2, left_index=True, right_index=True, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [67]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [68]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [69]:
right1

   group_val
a        3.5
b        7.0

In [72]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [76]:
another = DataFrame(np.arange(7., 15.).reshape((4, 2)), index=list('acef'), columns=['New York', 'Oregon'])

In [77]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      13.0    14.0

In [78]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [80]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [79]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [81]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      13.0    14.0

In [2]:
arr = np.arange(12).reshape((3, 4))

In [3]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [4]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [5]:
s1 = Series([0, 1], index=list('ab'))
s2 = Series([2, 3, 4], index=list('cde'))
s3 = Series([5, 6], index=list('fg'))

In [6]:
s1

a    0
b    1
dtype: int64

In [7]:
s2

c    2
d    3
e    4
dtype: int64

In [8]:
s3

f    5
g    6
dtype: int64

In [9]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [10]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [12]:
pd.concat([s1, s2, s3], axis=1, join='inner')

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [13]:
s1

a    0
b    1
dtype: int64

In [14]:
s4 = pd.concat([s1*5, s3])

In [15]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [16]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [17]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [18]:
pd.concat([s1, s2], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  NaN
c  NaN  2.0
b  1.0  NaN
e  NaN  4.0

In [19]:
pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [21]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [22]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [24]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [25]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [29]:
df1 = DataFrame(np.arange(6).reshape((3, 2)),
                index=['a', 'b', 'c'],
                columns=['one', 'two'])
df2 = DataFrame(5 + np.arange(4).reshape((2, 2)),
                index=['a', 'c'],
                columns=['three', 'four'])

In [30]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [31]:
df2

   three  four
a      5     6
c      7     8

In [34]:
pd.concat([df1, df2])

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

In [35]:
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [37]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [38]:
pd.concat({'level1': df1, 'level2': df2})

          four  one  three  two
level1 a   NaN  0.0    NaN  1.0
       b   NaN  2.0    NaN  3.0
       c   NaN  4.0    NaN  5.0
level2 a   6.0  NaN    5.0  NaN
       c   8.0  NaN    7.0  NaN

In [39]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [43]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [45]:
df3 = DataFrame(np.random.randn(3, 4), columns=list('abcd'))
df4 = DataFrame(np.random.randn(2, 3), columns=list('bda'))

In [46]:
df3

          a         b         c         d
0  0.349591  0.566124  0.815873 -1.567709
1 -1.251019  1.467552 -0.432800 -1.619969
2 -0.527518  1.790420 -1.507209 -0.863786

In [47]:
df4

          b         d         a
0 -0.617948  0.835607 -0.965203
1  0.634345  0.146763 -0.917567

In [49]:
pd.concat([df3, df4], ignore_index=True)

          a         b         c         d
0  0.349591  0.566124  0.815873 -1.567709
1 -1.251019  1.467552 -0.432800 -1.619969
2 -0.527518  1.790420 -1.507209 -0.863786
3 -0.965203 -0.617948       NaN  0.835607
4 -0.917567  0.634345       NaN  0.146763

In [50]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
           index=list('fedcba'))
b = Series(np.arange(len(a), dtype=np.float64),
           index=list('fedcba'))

In [51]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [52]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [54]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  5. ])

In [58]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [59]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [57]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [62]:
df1 = DataFrame({'a': [1., np.nan, 5., np.nan],
                 'b': [np.nan, 2., np.nan, 6.],
                 'c': range(2, 18, 4)})
df2 =DataFrame({'a': [5., 4., np.nan, 3., 7.],
                'b': [np.nan, 3., 4., 6., 8.]})

In [63]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [64]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [65]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [67]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [69]:
data = DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))

In [70]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [71]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [73]:
result = data.unstack()

In [74]:
result

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [75]:
result.unstack()

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [77]:
result2 = data.stack()

In [82]:
result2.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [84]:
result2.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [88]:
result2.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [89]:
s1 = Series([0, 1, 2, 3], index=list('abcd'))
s2 = Series([4, 5, 6], index=list('cde'))

In [90]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [91]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [92]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [93]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [94]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [95]:
df = DataFrame({'left': result, 'right': result + 5},
               columns=pd.Index(['left', 'right'], name='side'))

In [96]:
df

side             left  right
number state
one    Ohio         0      5
       Colorado     3      8
two    Ohio         1      6
       Colorado     4      9
three  Ohio         2      7
       Colorado     5     10

In [97]:
df.unstack()

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [99]:
df.unstack().stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## 将长格式旋转为宽格式

In [122]:
data = pd.read_csv('macrodata.csv')
data[:5]

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [123]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
data = DataFrame(data.to_records(),
                 columns=pd.Index(['realgdp', 'infl', 'unemp'], name='item'),
                 index=periods.to_timestamp('D', 'end'))

In [124]:
data[:5]

item         realgdp  infl  unemp
date
1959-03-31  2710.349  0.00    5.8
1959-06-30  2778.801  2.34    5.1
1959-09-30  2775.488  2.74    5.3
1959-12-31  2785.204  0.27    5.6
1960-03-31  2847.699  2.31    5.2

In [125]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [126]:
ldata[:5]

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340

In [132]:
pivoted = ldata.pivot('date', 'item', 'value')

In [133]:
pivoted[:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [135]:
ldata['value2'] = np.random.randn(len(ldata))

In [136]:
ldata[:5]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -2.581432
1 1959-03-31     infl     0.000 -1.475256
2 1959-03-31    unemp     5.800 -0.275059
3 1959-06-30  realgdp  2778.801  0.962830
4 1959-06-30     infl     2.340 -1.679110

In [143]:
pivoted = ldata.pivot('date', 'item')

In [145]:
pivoted[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -1.475256 -2.581432 -0.275059
1959-06-30  2.34  2778.801   5.1 -1.679110  0.962830 -0.385612
1959-09-30  2.74  2775.488   5.3  0.071409  0.939337 -0.871321
1959-12-31  0.27  2785.204   5.6  1.000619 -0.354646  0.615941
1960-03-31  2.31  2847.699   5.2 -0.561666  1.444041  0.420465

In [147]:
pivoted['value2'][:5]

item            infl   realgdp     unemp
date
1959-03-31 -1.475256 -2.581432 -0.275059
1959-06-30 -1.679110  0.962830 -0.385612
1959-09-30  0.071409  0.939337 -0.871321
1959-12-31  1.000619 -0.354646  0.615941
1960-03-31 -0.561666  1.444041  0.420465

In [148]:
ldata[:5]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -2.581432
1 1959-03-31     infl     0.000 -1.475256
2 1959-03-31    unemp     5.800 -0.275059
3 1959-06-30  realgdp  2778.801  0.962830
4 1959-06-30     infl     2.340 -1.679110

In [153]:
ldata.set_index(['date', 'item'])[:10]

                       value    value2
date       item
1959-03-31 realgdp  2710.349 -2.581432
           infl        0.000 -1.475256
           unemp       5.800 -0.275059
1959-06-30 realgdp  2778.801  0.962830
           infl        2.340 -1.679110
           unemp       5.100 -0.385612
1959-09-30 realgdp  2775.488  0.939337
           infl        2.740  0.071409
           unemp       5.300 -0.871321
1959-12-31 realgdp  2785.204 -0.354646

In [150]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')

In [154]:
unstacked[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -1.475256 -2.581432 -0.275059
1959-06-30  2.34  2778.801   5.1 -1.679110  0.962830 -0.385612
1959-09-30  2.74  2775.488   5.3  0.071409  0.939337 -0.871321
1959-12-31  0.27  2785.204   5.6  1.000619 -0.354646  0.615941
1960-03-31  2.31  2847.699   5.2 -0.561666  1.444041  0.420465

## 数据转换

In [2]:
data = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})

In [3]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [6]:
data['v1'] = range(7)

In [7]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [8]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [10]:
data.duplicated(['k1'])

0    False
1     True
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [11]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [14]:
data.drop_duplicates(['k1', 'k2'], keep='last')#书中的take_last=True 用法被抛弃

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [15]:
# 利用函数或映射进行数据转换
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                           'corned beef', 'Bacon', 'pastrami', 'honey ham',
                           'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [16]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [17]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [18]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [19]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [20]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [21]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [22]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [24]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [25]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [26]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [27]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [28]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 重命名轴索引

In [29]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [30]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [31]:
data.index.map(str.upper)

Index([u'OHIO', u'COLORADO', u'NEW YORK'], dtype='object')

In [32]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [33]:
data.index = data.index.map(str.upper)

In [34]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [35]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [36]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [38]:
data.rename(index={'Ohio': 'INDIANA'},
            columns={'three': 'peekaboo'})

          one  two  peekaboo  four
OHIO        0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [39]:
_ = data.rename(index={'Ohio': 'INDIANA'}, inplace=True)

In [40]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 离散化和面元化分

In [41]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [42]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [43]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
cats.labels

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: 'labels' is deprecated. Use 'codes' instead
  """Entry point for launching an IPython kernel.

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [47]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [48]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [49]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [50]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [51]:
data = np.random.randn(20)

In [52]:
data

array([ 1.59810066,  0.69106457, -1.41080039,  0.53365167,  0.49735652,
        0.09073628,  0.69846994,  1.96417736, -0.49419588,  0.00634081,
       -0.13257169,  1.05807779, -1.10097288,  1.59226716,  1.41515249,
       -0.0748999 ,  1.32607615, -0.51782138, -0.30224185,  0.62399032])

In [53]:
pd.cut(data, 4, precision=2)

[(1.12, 1.96], (0.28, 1.12], (-1.41, -0.57], (0.28, 1.12], (0.28, 1.12], ..., (-0.57, 0.28], (1.12, 1.96], (-0.57, 0.28], (-0.57, 0.28], (0.28, 1.12]]
Length: 20
Categories (4, interval[float64]): [(-1.41, -0.57] < (-0.57, 0.28] < (0.28, 1.12] < (1.12, 1.96]]

In [54]:
data = np.random.randn(1000)

In [55]:
cats = pd.qcut(data, 4)

In [56]:
cats

[(0.0666, 0.77], (0.77, 3.325], (0.77, 3.325], (0.77, 3.325], (0.77, 3.325], ..., (0.0666, 0.77], (0.0666, 0.77], (-3.471, -0.56], (0.77, 3.325], (-3.471, -0.56]]
Length: 1000
Categories (4, interval[float64]): [(-3.471, -0.56] < (-0.56, 0.0666] < (0.0666, 0.77] < (0.77, 3.325]]

In [57]:
pd.value_counts(cats)

(0.77, 3.325]      250
(0.0666, 0.77]     250
(-0.56, 0.0666]    250
(-3.471, -0.56]    250
dtype: int64

In [59]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.,])

In [60]:
pd.value_counts(cats)

(0.0666, 1.312]     400
(-1.111, 0.0666]    400
(1.312, 3.325]      100
(-3.471, -1.111]    100
dtype: int64

## 检测和过滤异常值

In [75]:
 np.random.seed(12345)

In [76]:
data = DataFrame(np.random.randn(1000, 4))

In [77]:
data.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [78]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [81]:
data[np.abs(data) > 3] = 10
data

            0         1          2         3
0   -0.204708  0.478943  -0.519439 -0.555730
1    1.965781  1.393406   0.092908  0.281746
2    0.769023  1.246435   1.007189 -1.296221
3    0.274992  0.228913   1.352917  0.886429
4   -2.001637 -0.371843   1.669025 -0.438570
5   -0.539741  0.476985  10.000000 -1.021228
6   -0.577087  0.124121   0.302614  0.523772
7    0.000940  1.343810  -0.713544 -0.831154
8   -2.370232 -1.860761  -0.860757  0.560145
9   -1.265934  0.119827  -1.063512  0.332883
10  -2.359419 -0.199543  -1.541996 -0.970736
11  -1.307030  0.286350   0.377984 -0.753887
12   0.331286  1.349742   0.069877  0.246674
13  -0.011862  1.004812   1.327195 -0.919262
14  -1.549106  0.022185   0.758363 -0.660524
15   0.862580 -0.010032   0.050009  0.670216
16   0.852965 -0.955869  -0.023493 -2.304234
17  -0.652469 -1.218302  -1.332610  1.074623
18   0.723642  0.690002   1.001543 -0.503087
19  -0.622274 -0.921169  -0.726213  0.222896
20   0.051316 -1.157719   0.816707  0.433610
21   1.010737  1.824875  -0.997518  0.850591
22  -0.131578  0.912414   0.188211  2.169461
23  -0.114928  2.003697   0.029610  0.795253
24   0.118110 -0.748532   0.584970  0.152677
25  -1.565657 -0.562540  -0.032664 -0.929006
26  -0.482573 -0.036264   1.095390  0.980928
27  -0.589488  1.581700  -0.528735  0.457002
28   0.929969 -1.569271  -1.022487 -0.402827
29   0.220487 -0.193401   0.669158 -1.648985
..        ...       ...        ...       ...
970  1.140886  0.113279   0.206782 -1.460094
971 -1.523554 -0.590572  -0.324064  0.132262
972  0.097878  1.244456  -0.048534 -1.091849
973 -0.738296  0.115881   0.016253 -1.243078
974 -1.969172 -1.141360   0.405558 -0.521155
975 -0.813280 -0.461413   1.159668 -0.307670
976  0.669147  0.397355   0.612537  1.381155
977 -0.042541  1.182125   0.153036  0.075798
978  0.615651 -1.992291   0.963044  0.102469
979  0.359400  0.355787  -0.799366  1.120895
980 -0.261844 -0.474138  -0.112021 -0.285176
981 -0.136429  1.285628   0.753586  0.053410
982 -0.355393  0.790731   1.274794  0.233619
983 -1.316005  1.396082   0.336700  0.604880
984  0.675317 -0.060329   1.801953 -0.335099
985 -0.754114  0.650691   0.365401  1.367213
986 -0.105654 -0.001860   0.316802 -0.512542
987 -0.052736 -0.457225   2.452835 -1.050942
988 -0.172078  0.853049  -0.356263 -0.387002
989  0.881601  1.067288   1.079688  1.642339
990 -0.103672 -0.882949  -0.197357  1.336648
991  0.926782 -0.527103   0.633763  0.153988
992 -0.527754  0.815104  -0.677870 -1.466596
993  0.957144  0.377342  -0.383241  1.101972
994  1.221058 -0.326481   0.750008  0.604072
995  1.089085  0.251232  -1.451985  1.653126
996 -0.478509 -0.010663  -1.060881 -1.502870
997 -1.946267  1.013592   0.037333  0.133304
998 -1.293122 -0.322542  -0.782960 -0.303340
999  0.089987  0.292291   1.177706  0.882755

[1000 rows x 4 columns]

In [66]:
col = data[3]

In [68]:
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [69]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [71]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [72]:
data.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [73]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [74]:
data.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

## 排列和随机采样

In [82]:
df = DataFrame(np.arange(5 * 4).reshape(5, 4))

In [83]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [85]:
sampler = np.random.permutation(5)

In [86]:
sampler

array([1, 3, 4, 0, 2])

In [87]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [88]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

In [89]:
len(df)

5

In [90]:
bag = np.array([5, 7, -1, 6, 4])

In [91]:
sampler = np.random.randint(0, len(bag), size=10)

In [92]:
sampler

array([2, 2, 0, 3, 0, 4, 1, 1, 2, 3])

In [94]:
draws = bag.take(sampler)

In [95]:
draws

array([-1, -1,  5,  6,  5,  4,  7,  7, -1,  6])

In [105]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                'data1': range(6)})

In [106]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [107]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [110]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [111]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [112]:
df_with_dummy = df[['data1']].join(dummies)

In [113]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [114]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [122]:
# 在MovieLens 1M 数据集上
mnames = ['moive_id', 'title', 'genres']
movies = pd.read_table('movielens/movies.dat', sep='::', header=None, names=mnames)

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

In [123]:
movies[:10]

   moive_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [124]:
genre_iter = (set(x.split('|')) for x in movies['genres'])

In [125]:
genre_iter

In [126]:
genres = sorted(set.union(*genre_iter))

In [127]:
genres

['Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']

In [128]:
dummies = DataFrame(np.zeros((len(movies), len(genres))), columns=genres)

In [129]:
for i, gen in enumerate(movies.genres):
    dummies.ix[i, gen.split('|')] = 1

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

In [130]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [132]:
movies_windic.ix[0]

d:\root\0-soft\python2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

moive_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

## 结合get_dummies 和 cut

In [133]:
values = np.random.rand(10)

In [134]:
values

array([ 0.96588737,  0.17373658,  0.87592824,  0.75415641,  0.163486  ,
        0.23784062,  0.85564381,  0.58743194,  0.15314009,  0.5950288 ])

In [135]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1.]

In [138]:
cats = pd.cut(values, bins)
cats

[(0.8, 1.0], (0.0, 0.2], (0.8, 1.0], (0.6, 0.8], (0.0, 0.2], (0.2, 0.4], (0.8, 1.0], (0.4, 0.6], (0.0, 0.2], (0.4, 0.6]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [139]:
pd.get_dummies(cats)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           1           0           0           0           0
2           0           0           0           0           1
3           0           0           0           1           0
4           1           0           0           0           0
5           0           1           0           0           0
6           0           0           0           0           1
7           0           0           1           0           0
8           1           0           0           0           0
9           0           0           1           0           0